## Practicando sqlalchemy no python

In [1]:
import pandas as pd 
import sqlalchemy as sql 
from sqlalchemy import create_engine, text
from sqlalchemy.engine import Engine

In [2]:
# conecta ao banco PostgreSQL
DB_URL = "postgresql+psycopg://postgres:postgres@localhost:5432/sql_course"
engine = create_engine(DB_URL)

print("Conexão estabelecida com sucesso!")

Conexão estabelecida com sucesso!

In [3]:
# cria o inspetor para explorar o banco de dados

inspector = sql.inspect(engine)
print(type(inspector))

<class 'sqlalchemy.dialects.postgresql.base.PGInspector'>

In [4]:
# listar todos os schemas
schemas = inspector.get_schema_names()
print("Schemas disponíveis:", schemas)

Schemas disponíveis: ['information_schema', 'public', 'sales', 'temp_tables']

In [5]:
# listar tabelas nos schemas disponíveis
for schema in schemas:
    tables = inspector.get_table_names(schema=schema)
    print(f"Tabelas no schema {schema}:", tables, "\n")
    print("-" * 50)

Tabelas no schema information_schema: ['sql_features', 'sql_implementation_info', 'sql_parts', 'sql_sizing']

--------------------------------------------------
Tabelas no schema public: []

--------------------------------------------------
Tabelas no schema sales: ['funnel', 'customers', 'products', 'stores']

--------------------------------------------------
Tabelas no schema temp_tables: ['ibge_genders', 'regions', 'duplicados', 'tabela_1', 'tabela_2', 'products_2']

--------------------------------------------------

### Pegar as tabelas de uma schema
___

In [6]:
tables_sales = inspector.get_table_names(schema="sales")
print(tables_sales)

['funnel', 'customers', 'products', 'stores']

In [8]:
# listar colunas de uma tabela
table_name = "sales"
columns_sales = inspector.get_columns("products", schema="sales")
for column in columns_sales:
    print(column["name"], column["type"])

product_id VARCHAR
brand VARCHAR
model VARCHAR
model_year VARCHAR
price NUMERIC

## Exercícios 
___

1. Liste as marcas de carro que constam na tabela products

In [10]:
QUERY = """
SELECT brand FROM sales.products;
"""
df_brands_from_products = pd.read_sql(QUERY, engine)

In [12]:
print("Brands na tabela products from sales schema:")
df_brands_from_products

Brands na tabela products from sales schema:

             brand
0          RENAULT
1       VOLKSWAGEN
2             FIAT
3           NISSAN
4             FIAT
..             ...
328          CHERY
329  MERCEDES-BENZ
330          FOTON
331           AUDI
332  MERCEDES-BENZ

[333 rows x 1 columns]

2. Verifique o total de marcas distintas que existe na coluna `brand` da tabela product from sales schema ?

In [13]:
QUERY = """
SELECT DISTINCT brand FROM sales.products;
"""
df_distinct_brands  = pd.read_sql(QUERY, engine)
print("Total de marcas distintas na coluna brand:")
df_distinct_brands

Total de marcas distintas na coluna brand:

            brand
0         TROLLER
1      VOLKSWAGEN
2           HAFEI
3           LIFAN
4          JINBEI
5           DODGE
6       SSANGYONG
7            FORD
8        CHRYSLER
9             JAC
10         NISSAN
11           MINI
12         SUZUKI
13         SUBARU
14          LEXUS
15            RAM
16         TOYOTA
17         JAGUAR
18     KIA MOTORS
19  MERCEDES-BENZ
20          CHERY
21           JEEP
22           AUDI
23          FOTON
24           EFFA
25      CHEVROLET
26        PORSCHE
27     MITSUBISHI
28          GEELY
29          HONDA
30        PEUGEOT
31        RENAULT
32           FIAT
33        CITROEN
34          SMART
35     LAND ROVER
36            BMW
37          VOLVO
38        HYUNDAI
39    LAMBORGHINI

In [14]:
len(df_distinct_brands)

40

Uma aplicação de análise mais encorpada feita primeiro SQL e depois aqui com python. 

**PROBLEMA**: é criar uma view ou nova tabela, que liste os emails da base que moram no estado de Santa Catarina, ou Mato Grosso do Sul, e que tenham mais de 30 anos.

```sql
--- Qdo a análise começa a ficar mais complexa é melhor utilizar-se CTE - common table expression
--- 1.calcula a idade - prepara os dados,
--- 2.e depois os filtra

WITH clientes_com_idade AS (
SELECT email, state,
EXTRACT(YEAR FROM AGE(NOW(), birth_date)) AS idade
FROM
	sales.customers
)
select email, state, idade
from clientes_com_idade
where
state in ('SC', 'MS') AND
idade > 30;
```

### Agora com python
___

Essa abordagem é muito poderosa para o seu objetivo de criar uma ferramenta, pois permite construir queries complexas de forma programática, segura (protegendo contra SQL injection) e, em muitos casos, independente do dialeto SQL específico do banco de dados.

In [15]:
# 1. Importar as funções necessárias do SQLAlchemy
from sqlalchemy import MetaData, Table, select, func, extract, or_

# 2. Criar um objeto MetaData
# O MetaData armazena informações sobre as tabelas do banco de dados.
metadata = MetaData()

# 3. Refletir a tabela 'customers' do schema 'sales' para um objeto Python
# O SQLAlchemy vai ler a estrutura da tabela no banco de dados e criar um objeto correspondente.
customers_table = Table(
    'customers', 
    metadata, 
    autoload_with=engine, 
    schema='sales'
)

# 4. Construir a query dinamicamente
# Esta é a parte onde traduzimos o SQL para código Python.

# Cálculo da idade: EXTRACT(YEAR FROM AGE(NOW(), birth_date))
age_calc = extract('year', func.age(func.now(), customers_table.c.birth_date)).label('idade')

# Construção da declaração SELECT
stmt = (
    select(
        customers_table.c.email,
        customers_table.c.state,
        age_calc  # Adicionamos a coluna de idade calculada
    )
    .where(
        # Condição 1: O estado é 'SC' OU 'MS'
        customers_table.c.state.in_(['SC', 'MS']),
        
        # Condição 2: A idade calculada é maior que 30
        age_calc > 30
    )
)

# 5. Executar a query e carregar o resultado em um DataFrame do Pandas
with engine.connect() as connection:
    result = connection.execute(stmt)
    df_customers_age = pd.DataFrame(result.fetchall(), columns=result.keys())

# 6. Exibir o resultado
print("Clientes de SC ou MS com mais de 30 anos:")
df_customers_age

Clientes de SC ou MS com mais de 30 anos:

                                     email state idade
0           adeize.luzildo797118@gmail.com    SC    77
1         juvenil.dhiovane446542@gmail.com    SC    73
2         sybelle.jardesom906220@gmail.com    SC    40
3     sinforoza.valterlins166764@gmail.com    SC    49
4          estevita.geliza424208@gmail.com    SC    61
...                                    ...   ...   ...
1552      laurecy.lauricio631290@gmail.com    SC    69
1553        cleudis.sharom718188@gmail.com    SC    31
1554    palmiria.deusidete121882@gmail.com    SC    76
1555          giedri.raysa506942@gmail.com    SC    39
1556      adejailma.duarte807886@gmail.com    SC    63

[1557 rows x 3 columns]

**Explicação do código acima:**

1. Importações: Trazemos as ferramentas necessárias como Table, select, func (para funções SQL como AGE e NOW), e extract.

2. MetaData: É um catálogo que o SQLAlchemy usa para manter as definições das tabelas.

3. Table Reflection: Table(...) com autoload_with=engine é o "link" que você mencionou. Ele se conecta ao banco, lê a estrutura da tabela sales.customers e a torna acessível em Python através do objeto customers_table. Agora você pode acessar as colunas como customers_table.c.email.

4. Construção da Query:

* age_calc: Criamos a expressão para calcular a idade de forma idêntica à que fizemos em SQL puro, mas usando funções do SQLAlchemy. .label('idade') cria o alias para a coluna.

* select(...): Inicia a construção da query, especificando as colunas que queremos no resultado final.

* .where(...): Aplica os filtros. Note como state IN ('SC', 'MS') se torna .state.in_(['SC', 'MS']) e a condição da idade usa o mesmo objeto age_calc. O SQLAlchemy combina as condições dentro do .where() com AND por padrão.

5. Execução: Abrimos uma conexão, executamos a instrução (stmt) e usamos o pandas para transformar o resultado em um DataFrame, que é o formato que você já está usando no notebook.

Ordem da Sintaxe SQL:

```sql
select distinct coluna1..., 
from schema.tabela
group by 
where condição
order by coluna numerica ASC ou DES e coluna texto basta ordenar pela coluna
limit N 

-- Funções agregadas - servem para executar operações aritméticas nos registro 
-- de uma coluna, elas eliminam as células (NULL)
-- count() pode-se utilizar o asterisco (*) para contar os registros
-- count(distinct) irá contar apenas os valores exclusivos
-- group by pode ou não ser utilizada com funções de agregação
-- group by sozinho funciona como DISTINCT
-- having funciona como um where qdo se usa group by: é um tipo de filtro
```